Repository: beingmeta/kno
Catalog: etc/intl/*.po
Languages: fr

source: Type error
fr: Erreur de type

source: Range error
fr: hors limite

source: %m expected
fr: attendait %m

source: #<MysteryVector 0x%x/0x%x %d elements>
fr: #<Objet Composée Mystérieux 0x%x/0x%x %d éléments>

source: #<MysteryPacket 0x%x/0x%x %d bytes>
fr: #<Paquet Mystérieux 0x%x/0x%x %d bytes>

source: No such key
fr: clé introuvable

source: Hashset Overflow
fr: débordement de table de hachage

source: Not a table
fr: pas un table

source: Table doesn't support get
fr: «get» opération pas supporté

source: Table doesn't support set
fr: «set» opération pas supporté

source: Table doesn't support add
fr: «add» opération pas supporté

source: Table doesn't support drop
fr: «drop» opération pas supporté

source: Table doesn't support test
fr: «test» opération pas supporté

source: Table doesn't support getkeys
fr: «getkeys» opération pas supporté

source: hashtable
fr: table de hachage

source: value is not a boolean
fr: n'est pas une boolean

source: Unexpected end of data
fr: Fin prématurée des données

source: Malformed DTYPE representation
fr: représentation «DTYPE» mal formulée

source: Invalid constant
fr: constante invalide

source: Can't open file
fr: ne peut ouvrir le fichier

source: Invalid escape sequence
fr: séquence d'échappement invalide

source: Invalid constant reference
fr: référencé constante invalide

source: Invalid character constant
fr: caractère pas valide

source: Bad atomic expression
fr: Expression atomique mal formulée

source: no pointer expressions allowed
fr: Expression pointeur ne sont pas permis

source: bad pointer reference
fr: référencé pointeur invalide

source: Can't parse record object
fr: erreur d'analyse syntaxique: objet composée mal formulée

source: no handler
fr: opération pas supporté

source: Method not supported
fr: opération pas supporté

source: constant
fr: constante

source: character
fr: caractère

source: symbol
fr: symbole

source: string
fr: chaîne

source: packet
fr: paquet

source: bigint
fr: nombre entier grande

source: pair
fr: paire

source: compound
fr: object composée

source: choice
fr: choix

source: achoice
fr: choix mutable

source: vector
fr: vecteur

source: flonum
fr: nombre en virgule flottante

source: wrapper
fr: envelope

source: mystery
fr: objet mystérieux

source: Unknown error condition
fr: erreur inconnu

source: FramerD Database internal error
fr: Erreur interne: FramerD base de données

source: Ambiguous object name
fr: Le nom d'objet est ambiguë

source: Unknown object name
fr: L'objet nommé est inconnu

source: bad server response
fr: Réponse mal formulée d'un serveur

source: No default background indices
fr: il n'y a pas d'indices par défaut

source: object name lookup
fr: trouver objet de nom

source: file indices are not supported
fr: fichiers d'index pas supporté

source: Can't lock OID
fr: ne peut verrouiller OID

source: Invalid pool PTR
fr: Erreur interne: référence à lot invalide

source: file pools are not supported
fr: fichiers d'index pas supporté

source: no pool covers this OID
fr: Il n'y a pas une lot pour cette OID

source: pool
fr: lot

source: Pool conflict
fr: conflit entre lots

source: Corrupted pool table
fr: table de lots corrompu

source: calling a non function
fr: pas une fonction

source: too many arguments
fr: trop de arguments

source: too few arguments
fr: trop peu de arguments

source: #<Primitive %s (%d args)>
fr: #<Primitif %s (%d args)>

source: #<Primitive %s>
fr: #<Primitif %s>

source: Odd number of args to find frames
fr: trop peu de arguments à «find-frames»

source: File contains metadata from the future
fr: fichier a apparaît de le futur

source: Schema inconsistency
fr: Erreur interne: schema inconsistent

source: file index hash overflow
fr: débordement de une fichiers d'index

source: Internal error with index file
fr: Erreur interne avec une fichiers d'index

source: SCHEME expression syntax error
fr: Expression exécutable mal formulée

source: the variable is unbound
fr: variable non définie

source: not an identifier
fr: pas une identificateur

source: ;; Took %f seconds to evaluate %q ;; yielding %q
fr: ;; %f secondes pour l'exécution de %q ;; à %q

source: Can't bind variable
fr: ne peut lier identificateur

source: Bad binding expression
fr: expression de liaison mal formulée

source: invalid cond clause
fr: «cond» expression mal formulée

source: identifier is not a symbol
fr: identificateur n'est pas une symbole

source: list
fr: liste

source: Can't find named module
fr: ne peut repérer le module

source: Not a filename
fr: pas un nom de fichier valide

source: File not found
fr: fichier non repéré

source: string or symbol
fr: chaîne ou symbole

source: byte
fr: octet

source: sequence
fr: séquence

source: output port
fr: port à la sortie

source: input port
fr: port à l'entrée

source: Eval:
fr: Éval:

source: ;; (ERROR) %m (%m)
fr: ;; (Erreur) %m (%m)

source: ;; (ERROR) %m
fr: ;; (Erreur) %m

source: { ;; %d values
fr: { ;; %d résultats

source: } ;; %d values
fr: } ;; %d résultats

source: ;; Evaluation took %f seconds
fr: ;; Temps d'exécution: %f secondes
